# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и возводит 
# число А в целую степень B с помощью рекурсии. Пример:  A = 3; B = 5 -> 243 (3⁵)       
# A = 2; B = 3 -> 8 

# number = int(input('Enter a number A: '))
# degree = int(input('Enter a degree B: '))

# def powering (number, degree):
#     if degree == 0:
#         return 1
#     elif degree == 1:
#         return number
#     else:
#         return number * powering(number, degree-1)

# print(powering(number, degree))

# *******************************************************************************
# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных 
# чисел. Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать 
# циклы.  Пример:  2 2     4

# number1 = int(input('Enter a number a: '))
# number2 = int(input('Enter a number b: '))

# def sum(number1, number2):
#     if number2 == 0:
#         return number1
#     else:
#         return 1 + sum(number1, number2-1)

# if number1 < 0 or number2 < 0: 
#     print('Entered negative number')
# else:
#     print(sum(number1, number2))





    
